lizhiok/FPInterro/Libraries/MDK_LIB/RL/CAN/Drivers/CAN_STM32F20x.c
/*----------------------------------------------------------------------------
 *      RL-ARM - CAN
 *----------------------------------------------------------------------------
 *      Name:    CAN_STM32F20x.c
 *      Purpose: CAN Driver, Hardware specific module for ST STM32F20x
 *      Rev.:    V4.70
 *----------------------------------------------------------------------------
 *      This code is part of the RealView Run-Time Library.
 *      Copyright (c) 2004-2013 KEIL - An ARM Company. All rights reserved.
 *---------------------------------------------------------------------------*/

#include <RTL.h>                      /* RTX kernel functions & defines      */
#include <RTX_CAN.h>                  /* CAN Generic functions & defines     */
#include <stm32f2xx.h>                /* STM32F20x register definitions      */


#define __CTRL1                 1
#define __CTRL2                 2

#define __FILTER_BANK_MAX      27     /* filter banks 0..27 */


/************************* CAN Hardware Configuration ************************/

// *** <<< Use Configuration Wizard in Context Menu >>> ***

// <o> CAN Peripheral Clock (in Hz) <1-1000000000>
//     <i> Same as APB1 clock
#define CAN_CLK               30000000

// *** <<< End of Configuration section             >>> ***


/*----------------------------------------------------------------------------
 *      CAN RTX Hardware Specific Driver Functions
 *----------------------------------------------------------------------------
 *  Functions implemented in this module:
 *    static      void CAN_set_timing      (U32 ctrl, U32 tseg1, U32 tseg2, U32 sjw, U32 brp)
 *    static CAN_ERROR CAN_hw_set_baudrate (U32 ctrl, U32 baudrate)
 *           CAN_ERROR CAN_hw_setup        (U32 ctrl)
 *           CAN_ERROR CAN_hw_init         (U32 ctrl, U32 baudrate)
 *           CAN_ERROR CAN_hw_start        (U32 ctrl)
 *           CAN_ERROR CAN_hw_testmode     (U32 ctrl, U32 testmode)
 *           CAN_ERROR CAN_hw_tx_empty     (U32 ctrl)
 *           CAN_ERROR CAN_hw_wr           (U32 ctrl,         CAN_msg *msg)
 *    static      void CAN_hw_rd           (U32 ctrl, U32 ch, CAN_msg *msg)
 *           CAN_ERROR CAN_hw_set          (U32 ctrl,         CAN_msg *msg)
 *           CAN_ERROR CAN_hw_rx_object    (U32 ctrl, U32 ch, U32 id, U32 object_para)
 *           CAN_ERROR CAN_hw_tx_object    (U32 ctrl, U32 ch,         U32 object_para)
 *    Interrupt fuction
 *---------------------------------------------------------------------------*/

/* Static functions used only in this module                                 */
static void CAN_hw_rd            (U32 ctrl, U32 ch, CAN_msg *msg);
static BOOL CAN_hw_rx_object_chk (U32 ctrl, U16 bank,         U32 object_para);
static void CAN_hw_rx_object_add (U32 ctrl, U16 bank, U32 id, U32 object_para);

/* CAN Controller Register Addresses                                         */
CAN_TypeDef *CAN_CTRL[] = { CAN1, CAN2 };

/* Static variables used only in this module                                 */
static U16 CAN1_filterIdx = 0;
static U16 CAN2_filterIdx = 0;

/************************* Auxiliary Functions *******************************/

/*--------------------------- CAN_set_timing --------------------------------
 *
 *  Setup the CAN timing with specific parameters
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              tseg1:      Specifies Time Segment before the sample point
 *              tseg2:      Time Segment after the sample point
 *              sjw:        Synchronisation Jump Width
 *              brp:        Baud Rate Prescaler
 *
 *---------------------------------------------------------------------------*/

static void CAN_set_timing (U32 ctrl, U32 tseg1, U32 tseg2, U32 sjw, U32 brp) {
  CAN_TypeDef *CANx = CAN_CTRL[ctrl-1];

  CANx->BTR &= ~(((          0x03) << 24) | ((            0x07) << 20) | ((            0x0F) << 16) | (          0x3FF));
  CANx->BTR |=  ((((sjw-1) & 0x03) << 24) | (((tseg2-1) & 0x07) << 20) | (((tseg1-1) & 0x0F) << 16) | ((brp-1) & 0x3FF));
}


/*--------------------------- CAN_set_baudrate ------------------------------
 *
 *  Setup the requested baudrate
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *              baudrate:   Baudrate
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

static CAN_ERROR CAN_hw_set_baudrate (U32 ctrl, U32 baudrate)  {
  U32 brp;

  /* Note: this calculations fit for CAN_CLK = 30MHz                         */
  /* Determine which nominal time to use for requested baudrate and set
     appropriate bit timing                                                  */
  if (baudrate <= 500000)  {
    brp  = (CAN_CLK / 15) / baudrate;

    /* Load the baudrate registers BTR                                       */
    /* so that sample point is at about 72% bit time from bit start          */
    /* TSEG1 = 10, TSEG2 = 4, SJW = 4 => 1 CAN bit = 15 TQ, sample at 67%    */
    CAN_set_timing(ctrl, 10, 4, 4, brp);
  }  else if (baudrate <= 1000000)  {
    brp  = (CAN_CLK / 10) / baudrate;

    /* Load the baudrate registers BTR                                       */
    /* so that sample point is at about 72% bit time from bit start          */
    /* TSEG1 = 6, TSEG2 = 3, SJW = 3 => 1 CAN bit = 10 TQ, sample at 70%     */
    CAN_set_timing(ctrl,  6, 3, 3, brp);
  }  else  {
    return CAN_BAUDRATE_ERROR;
  }

  return CAN_OK;
}


/*************************** Module Functions ********************************/

/*--------------------------- CAN_hw_setup ----------------------------------
 *
 *  Setup CAN transmit and receive PINs and interrupt vectors
 *
 *  Parameter:  ctrl:       Index of the hardware CAN controller (1 .. x)
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_setup (U32 ctrl)  {

  switch (ctrl) {
    case 1: 
      #if USE_CAN_CTRL1 == 1
       #ifdef STM3220G_EVAL
        /* Enable clock for CAN1 and GPIOD */
        RCC->APB1ENR   |= (1 << 25);
        RCC->AHB1ENR   |= (1 <<  3);
        /* CAN1, use PD0, PD1 */
        GPIOD->MODER   &= ~(( 3 << ( 0 << 1)) | ( 3 << ( 1 << 1)));
        GPIOD->MODER   |=  (( 2 << ( 0 << 1)) | ( 2 << ( 1 << 1)));
        GPIOD->OTYPER  &= ~(( 1 <<   0)       | ( 1 <<   1      ));
        GPIOD->OSPEEDR &= ~(( 3 << ( 0 << 1)) | ( 3 << ( 1 << 1)));
        GPIOD->PUPDR   &= ~(( 3 << ( 0 << 1)) | ( 3 << ( 1 << 1)));
        GPIOD->AFR[0]  &= ~((15 << ( 0 << 2)) | (15 << ( 1 << 2)));
        GPIOD->AFR[0]  |=  (( 9 << ( 0 << 2)) | ( 9 << ( 1 << 2)));
       #else
        /* Enable clock for CAN1, GPIOH and GPIOI */
        RCC->APB1ENR   |= (1 << 25);
        RCC->AHB1ENR   |= (1 <<  7) | (1 << 8);
        /* CAN1, use PH13, PI9 */
        GPIOH->MODER   &= ~( 3 << (13 << 1));
        GPIOH->MODER   |=  ( 2 << (13 << 1));
        GPIOH->OTYPER  &= ~( 1 <<  13);
        GPIOH->OSPEEDR &= ~( 3 << (13 << 1));
        GPIOH->PUPDR   &= ~( 3 << (13 << 1));
        GPIOH->AFR[1]  &= ~(15 << ( 5 << 2));
        GPIOH->AFR[1]  |=  ( 9 << ( 5 << 2));

        GPIOI->MODER   &= ~( 3 << ( 9 << 1));
        GPIOI->MODER   |=  ( 2 << ( 9 << 1));
        GPIOI->OTYPER  &= ~( 1 <<   9);
        GPIOI->OSPEEDR &= ~( 3 << ( 9 << 1));
        GPIOI->PUPDR   &= ~( 3 << ( 9 << 1));
        GPIOI->AFR[1]  &= ~(15 << ( 1 << 2));
        GPIOI->AFR[1]  |=  ( 9 << ( 1 << 2));
       #endif
        /* Enable CAN1 interrupts */
        NVIC_SetPriority (CAN1_TX_IRQn,  1);
        NVIC_SetPriority (CAN1_RX0_IRQn, 1);
        NVIC_EnableIRQ   (CAN1_TX_IRQn);
        NVIC_EnableIRQ   (CAN1_RX0_IRQn);
      #endif
      break;
    case 2: 
      #if USE_CAN_CTRL2 == 1
        /* Enable clock for CAN2 and GPIOB */
        RCC->APB1ENR   |= (1 << 25) | (1 << 26);
        RCC->AHB1ENR   |= (1 <<  1);
        /* CAN2, use PB5, PB13 */
        GPIOB->MODER   &= ~(( 3 << ( 5 << 1)) | ( 3 << (13 << 1)));
        GPIOB->MODER   |=  (( 2 << ( 5 << 1)) | ( 2 << (13 << 1)));
        GPIOB->OTYPER  &= ~(( 1 <<   5)       | ( 1 <<  13      ));
        GPIOB->OSPEEDR &= ~(( 3 << ( 5 << 1)) | ( 3 << (13 << 1)));
        GPIOB->PUPDR   &= ~(( 3 << ( 5 << 1)) | ( 3 << (13 << 1)));
        GPIOB->AFR[0]  &= ~ (15 << ( 5 << 2));
        GPIOB->AFR[0]  |=   ( 9 << ( 5 << 2));
        GPIOB->AFR[1]  &= ~ (15 << ( 5 << 2));
        GPIOB->AFR[1]  |=   ( 9 << ( 5 << 2));
        /* Enable CAN2 interrupts */
        NVIC_SetPriority (CAN2_TX_IRQn,  1);
        NVIC_SetPriority (CAN2_RX0_IRQn, 1);
        NVIC_EnableIRQ   (CAN2_TX_IRQn);
        NVIC_EnableIRQ   (CAN2_RX0_IRQn);
      #endif
      break;
    default:
      return CAN_UNEXIST_CTRL_ERROR;
  }

  return CAN_OK;
}

